app/views/layouts/shared/_navbar.html.erb

SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = 1 LIMIT 1
---
                  <i class="fas fa-shopping-cart fa-lg"></i>
                  <% if @cart&.cart_items&.any? %>

SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = 1 LIMIT 1
---
              <div class="dropdown-menu dropdown-menu-end cart-dropdown p-3 shadow rounded-4" style="min-width: 320px;">
                <% if @cart&.cart_items&.any? %>