app/controllers/admin/categories_controller.rb

SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = 4
---
  def index
    @categories = Category.includes(:products).all
    .page(params[:page]).per(params[:per_page] || 10)