app/views/admin/categories/index.html.erb

                    <i class="fas fa-cube me-1"></i>
                    <%= category.products.count %> products
---
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = 4