app/views/admin/products/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= form.label :category_id, class: "form-label fw-bold" %>
    <%= form.collection_select :category_id, Category.all, :id, :name, { prompt: "Select a category" }, { class: "form-select" } %>