app/controllers/application_controller.rb

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES (6, '2025-07-15 09:59:50.814507', '2025-07-15 09:59:50.814507') RETURNING "id"
---
  def set_cart
    return unless current_user
    @cart = current_user.cart || current_user.create_cart