app/controllers/carts_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
---
  def add_item
    # FirstWorkerJob.perform_later("Adding item to cart")
    @cart = current_user.cart
    product = Product.find(params[:product_id])

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = 6 LIMIT 1
---
  def remove_item
    @cart = current_user.cart
    puts @cart.cart_items.inspect

    cart_item = @cart.cart_items.find(params[:id])