app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES ('csd', 'ds', '2025-07-11 10:42:30.505297', '2025-07-11 10:42:30.505297') RETURNING "id"
---
  def create
    @category = Category.new(category_params)
    authorize @category
    respond_to do |format|
      if @category.save

DELETE FROM "categories" WHERE "categories"."id" = 3
---
  def destroy
    authorize @category
    @category.destroy!