app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC LIMIT 1
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("title", "creator", "description", "published_date", "created_at", "updated_at") VALUES ('Post 1', 'Creator 1', 'Post 1 descritpion', '2025-07-07', '2025-07-07 03:17:47.245696', '2025-07-07 03:17:47.245696') RETURNING "id"
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
---
    def set_post
      @post = Post.find(params.expect(:id))