app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
---
  def show
    @product = Product.find(params.expect(:id))

SELECT "categories".* FROM "categories"
---
  def new
    @product = Product.new
    @categories = Category.all

SELECT "categories".* FROM "categories"
---
  def edit
    @categories = Category.all

INSERT INTO "products" ("user_id", "name", "description", "price", "file_url", "average_rating", "category_id", "created_at", "updated_at") VALUES (1, 'Product 1', 'P1', NULL, '', NULL, 1, '2025-07-13 08:27:01.298070', '2025-07-13 08:27:01.298070') RETURNING "id"
---
  def create
    @product = Product.new(product_params)
    @product.user_id = current_user.id
    authorize @product
    respond_to do |format|
      if @product.save

UPDATE "products" SET "file_url" = 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQd5WhixI1vS5R5DDDYiQRLPjrsnMkRWBErCQ&s', "updated_at" = '2025-07-16 06:22:33.095558' WHERE "products"."id" = 2
---
  def update
    authorize @product
    respond_to do |format|
      if @product.update(product_params)

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
---
    def set_product
      @product = Product.find(params.expect(:id))