app/controllers/products_controller.rb

  def index
    @q = policy_scope(Product)
    .includes(:thumbnail_attachment, :category, :asset_attachment)
    .where(status: "published")
    .ransack(params[:q])
    @products = @q.result
    .page(params[:page])
    .per(params[:per_page] || 6)
---
SELECT "categories".* FROM "categories"