app/views/products/_form.html.erb

    <%= form.label :category_id, class: "form-label" %>
    <%= form.collection_select :category_id,
                             Category.all,
                             :id,
                             :name,
                             { prompt: "Select a category" },
                             { class: "form-select" } %>
---
SELECT "categories".* FROM "categories"