app/views/layouts/buyer.html.erb

                  <i class="fas fa-shopping-cart"></i>
                  <% if @cart&.cart_items&.any? %>
---
SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = 1 LIMIT 1

              <div class="dropdown-menu dropdown-menu-end cart-dropdown">
                <% if @cart&.cart_items&.any? %>
---
SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = 1 LIMIT 1